src/DataProcessors/am_ПомощникМенеджераЗакупок/am_ПомощникМенеджераЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>am_ПомощникМенеджераЗакупок</name>
  <tabularSections>
    <name>НоменклатураКЗаказу</name>
    <attributes>
      <name>Выбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВПути</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КЗаказу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокЗаказов</name>
    <attributes>
      <name>ЗаказПоставщикуСсылка</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="49c4fd20-9868-483b-b488-8c57fd046bdc">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="0d19eb74-bf6e-4116-86fe-df31d53de608">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9bbb1a13-6b20-4404-9200-e9443b24ff4a">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e610b9a6-c6a5-4365-bd2e-749d31a6932a">
    <name>Актуальность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="60782cbe-1ea8-49b3-8d12-06b63e48f302">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a28e04ee-8fae-48f0-b7c4-e031134c920f">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d003232-5e09-4e5c-94f9-008a3b9c38e0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="91112615-1767-47d9-8493-56f4f6155586">
  <name>Запасы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="f72e33d3-324f-4f94-a330-a919e0f98615">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c7062576-207c-44e8-825d-004e5809e5ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="7f9237f1-027e-4670-9ba7-4167ac725dfb">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="74a630ed-a0e3-4e20-874c-32e15365b300">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b2cd2e24-61a2-48a7-b133-f28bf6497017">
    <name>СчетУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3400ef97-0dfb-4ed4-8038-011261a9ace3">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2c140d47-2059-4f8f-a235-e3e91129b658">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="935b3699-2154-4396-beb4-9d3089189c2c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="afd50769-dbc5-49f4-afda-ed7b0aa63e1d">
  <name>ЗаказыПоставщикам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="8513e7df-0b74-4d58-a48c-05b111fded15">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f48b1504-4344-4f68-ae5e-4047600d68ce">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="97578a66-7055-47ce-9765-f07b8ef18280">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7b1188c1-5a03-45a5-aa71-8f18b534afca">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e1fc91ba-749b-428c-bc1b-bcc14e935e98">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="19a9d422-729a-48be-8480-758fe0affd57">
  <name>Продажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="2b709ea2-8056-456c-904b-dc722eaaa02c">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="26c87d0a-dfb0-46fe-9eaf-249941f994f9">
    <name>Себестоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="dd98218b-e2a9-4d0e-a09f-59fdd5f2b7ec">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce74e11c-fbff-4738-b412-2817d474112a">
    <name>СуммаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9d21b7bd-12e3-4cb5-bbfd-55d45a58d48a">
    <name>СуммаБезСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bbe19ebf-4712-441a-a411-23403b388256">
    <name>КоличествоИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3eb639dc-e689-42d3-ac5a-453a5eb72bc7">
    <name>СуммаИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fedf21e8-4025-43f4-93e5-bcc3c9b5446b">
    <name>СуммаНДСИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="90999c47-431c-452b-802e-1cefa98c3497">
    <name>СуммаБезСкидкиИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd8c0a36-5428-4948-85d3-06c4e8343e83">
    <name>СебестоимостьИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="91ae51b5-3a57-4cd0-9d1d-1cd41524001a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b41be0bb-c3d9-4714-9af5-4150fef35fb4">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1200f453-74e5-4239-93f3-750bc56e0531">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1a59960d-5474-4c9a-9da4-f759a3095c4d">
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0370437b-6ab6-45a8-870f-065bb55552d3">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d251148a-4562-4e4a-82cb-a6d566cd7f8d">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="df0267de-bf94-47da-af17-489afa4b9ed3">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b30edf4d-c63d-4e56-8ff9-17d1f96ef87d">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ce2ae764-1f2c-4aa5-8a79-8f79cb6f46e5">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9d582038-c1f3-409a-88c7-c60ef602de6b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="baf008fb-7426-45b2-9882-953fb2bafe5b">
    <name>НоменклатураНабора</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4131d997-dafa-404d-a1bc-919ab4f5e5c1">
    <name>ХарактеристикаНабора</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="91dfbf85-19aa-430a-8303-eef0b294382c">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыОперацийЗаказПоставщику/ВидыОперацийЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="195594a6-bc92-4279-99a7-226a9e295650">
  <name>ВидыОперацийЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9268666f-650c-4011-b6f7-e0c79daf9b7a">
    <name>ЗаказНаЗакупку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/am_ПомощникМенеджераЗакупок/Forms/Форма/Module.bsl
&НаСервере
Процедура ОбновитьИнформациюНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	                      |	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ПОМЕСТИТЬ втЦеныНоменклатурыСрезПоследних
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Учетная)) КАК ЦеныНоменклатурыСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	                      |	ЗапасыОстатки.КоличествоОстаток КАК ТекущийОстаток,
	                      |	0 КАК ВПути
	                      |ПОМЕСТИТЬ втОстатки
	                      |ИЗ
	                      |	РегистрНакопления.Запасы.Остатки(, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗаказыПоставщикамОстатки.Номенклатура,
	                      |	0,
	                      |	ЗаказыПоставщикамОстатки.КоличествоОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ЗаказыПоставщикам.Остатки(, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыПоставщикамОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втОстатки.Номенклатура КАК Номенклатура,
	                      |	СУММА(втОстатки.ТекущийОстаток) КАК ТекущийОстаток,
	                      |	СУММА(втОстатки.ВПути) КАК ВПути
	                      |ПОМЕСТИТЬ втОстаткиОбщие
	                      |ИЗ
	                      |	втОстатки КАК втОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	втОстатки.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втОстаткиОбщие.Номенклатура КАК Номенклатура,
	                      |	втОстаткиОбщие.ТекущийОстаток КАК ТекущийОстаток,
	                      |	втОстаткиОбщие.ВПути КАК ВПути
	                      |ПОМЕСТИТЬ втОстаткиОбщиеСЦенами
	                      |ИЗ
	                      |	втОстаткиОбщие КАК втОстаткиОбщие
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПродажиОбороты.Номенклатура КАК Номенклатура,
	                      |	ПродажиОбороты.КоличествоОборот КАК Продано,
	                      |	ПродажиОбороты.Номенклатура.ВерхняяГраницаОстатков КАК МаксимальныйОстаток,
	                      |	ПродажиОбороты.Номенклатура.Поставщик КАК Поставщик,
	                      |	ЕСТЬNULL(втОстаткиОбщиеСЦенами.ТекущийОстаток, 0) КАК ТекущийОстаток,
	                      |	ЕСТЬNULL(втОстаткиОбщиеСЦенами.ВПути, 0) КАК ВПути,
	                      |	ЕСТЬNULL(ЦеныПоНоменклатуре.Цена, 0) КАК Цена
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Период, ) КАК ПродажиОбороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиОбщиеСЦенами КАК втОстаткиОбщиеСЦенами
	                      |		ПО (втОстаткиОбщиеСЦенами.Номенклатура = ПродажиОбороты.Номенклатура)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныНоменклатурыСрезПоследних КАК ЦеныПоНоменклатуре
	                      |		ПО (ЦеныПоНоменклатуре.Номенклатура = ПродажиОбороты.Номенклатура)");
	Запрос.УстановитьПараметр("ДатаНачала", ПериодПродаж.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодПродаж.ДатаОкончания);
	Объект.НоменклатураКЗаказу.Загрузить(Запрос.Выполнить().Выгрузить());
	       
КонецПроцедуры

&НаСервере
Функция ПолучитьДополнительнуюИнформациюПоНоменклатуре(НоменклатураСсылка)
	
	СтруктураИнформации = Новый Структура;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриходнаяНакладнаяЗапасы.Цена КАК Цена,
	                      |	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	                      |ГДЕ
	                      |	ПриходнаяНакладнаяЗапасы.Номенклатура = &Номенклатура
	                      |	И ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПриходнаяНакладнаяЗапасы.Ссылка.Дата УБЫВ");
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		СтруктураИнформации.Вставить("Поставщик", Результат.Контрагент);
		СтруктураИнформации.Вставить("Цена", Результат.Цена);
	Иначе
		СтруктураИнформации.Вставить("Поставщик", Справочники.Контрагенты.ПустаяСсылка());
		СтруктураИнформации.Вставить("Цена", 0);
	КонецЕсли;
	
	Возврат СтруктураИнформации;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнформацию(Команда)
	ОбновитьИнформациюНаСервере();
	
	ВсегоОпераций = Объект.НоменклатураКЗаказу.Количество();
	ТекущаяОперация = 0;
	
	Для Каждого Стр Из Объект.НоменклатураКЗаказу Цикл
		
		Если Стр.МаксимальныйОстаток > (Макс(Стр.ТекущийОстаток, 0) + Стр.ВПути) Тогда
			Стр.КЗаказу = Стр.МаксимальныйОстаток - Макс(Стр.ТекущийОстаток, 0) - Стр.ВПути;
			Стр.Выбор = Истина;
		КонецЕсли;

		ТекущаяОперация = ТекущаяОперация + 1;
		Состояние(Стр.Номенклатура, ТекущаяОперация / ВсегоОпераций * 100);
		//Если НЕ ЗначениеЗаполнено(Стр.Поставщик) ИЛИ НЕ ЗначениеЗаполнено(Стр.Цена) Тогда
			СтруктураДополнительныхДанных = ПолучитьДополнительнуюИнформациюПоНоменклатуре(Стр.Номенклатура);
			Если ЗначениеЗаполнено(СтруктураДополнительныхДанных.Поставщик) Тогда
				Стр.Поставщик = СтруктураДополнительныхДанных.Поставщик;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтруктураДополнительныхДанных.Цена) Тогда
				Стр.Цена = СтруктураДополнительныхДанных.Цена;
			КонецЕсли;
		//КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого СтрокаНоменклатуры Из Объект.НоменклатураКЗаказу Цикл
		СтрокаНоменклатуры.Выбор = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	
	Для Каждого СтрокаНоменклатуры Из Объект.НоменклатураКЗаказу Цикл
		СтрокаНоменклатуры.Выбор = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКЗаказуКЗаказуПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.НоменклатураКЗаказу.ТекущиеДанные;
	СтрокаТабличнойЧасти.Выбор = НЕ СтрокаТабличнойЧасти.КЗаказу = 0;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаказыПоставщикамНаСервере()
	
	ЗаказныеПозиции = Объект.НоменклатураКЗаказу.Выгрузить();
	Для Индекс = -ЗаказныеПозиции.Количество() + 1 По 0 Цикл
		Если НЕ ЗаказныеПозиции[-Индекс].Выбор Тогда
			ЗаказныеПозиции.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;
	
	ПоставщикиЗаказныхПозиций = ЗаказныеПозиции.Скопировать();
	ПоставщикиЗаказныхПозиций.Свернуть("Поставщик");
	
	СтруктураНовогоДокумента = Новый Структура;
	СтруктураНовогоДокумента.Вставить("Организация", Справочники.Организации.ОрганизацияПоУмолчанию());
	СтруктураНовогоДокумента.Вставить("СтруктурнаяЕдиницаРезерв", Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	СтруктураНовогоДокумента.Вставить("СтруктурнаяЕдиница", Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	СтруктураНовогоДокумента.Вставить("ВалютаДокумента", Константы.ВалютаУчета.Получить());
	СтруктураНовогоДокумента.Вставить("СостояниеЗаказа", Справочники.СостоянияЗаказовПоставщикам.НайтиПоНаименованию("В работе"));
	СтруктураНовогоДокумента.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
	СтруктураНовогоДокумента.Вставить("БанковскийСчет", Справочники.БанковскиеСчета.БанковскийСчетСубъекта(СтруктураНовогоДокумента.Организация));
	СтруктураНовогоДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку);
	СтруктураНовогоДокумента.Вставить("ДатаПоступления", ТекущаяДата() + 86400*7);
	СтруктураНовогоДокумента.Вставить("Касса", Справочники.Кассы.ПолучитьКассуПоУмолчанию(СтруктураНовогоДокумента.Организация));
	СтруктураНовогоДокумента.Вставить("Комментарий", "Документ создан из помощника менеджера закупок");
	СтруктураНовогоДокумента.Вставить("Кратность", 1);
	СтруктураНовогоДокумента.Вставить("Курс", 1);
	СтруктураНовогоДокумента.Вставить("НалогообложениеНДС", УправлениеНебольшойФирмойСервер.НалогообложениеНДС(СтруктураНовогоДокумента.Организация,, ТекущаяДата()));
	СтруктураНовогоДокумента.Вставить("НДСВключатьВСтоимость", Истина);
	//СтруктураНовогоДокумента.Вставить("Ответственный", Справочники.Пользователи.);
	СтруктураНовогоДокумента.Вставить("ПоложениеДатыПоступления", Перечисления.ПоложениеРеквизитаНаФорме.ВШапке);
	СтруктураНовогоДокумента.Вставить("СуммаВключаетНДС", Истина);
	СтруктураНовогоДокумента.Вставить("ХозяйственнаяОперация", Справочники.ХозяйственныеОперации.ЗаказНаЗакупку);
	Если СтруктураНовогоДокумента.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		СтруктураНовогоДокумента.Вставить("СтавкаНДСПоУмолчанию", Справочники.СтавкиНДС.НайтиПоНаименованию("20%", Истина));
	Иначе
		СтруктураНовогоДокумента.Вставить("СтавкаНДСПоУмолчанию", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
	КонецЕсли;
	
	Для Каждого СтрокаПоставщика Из ПоставщикиЗаказныхПозиций Цикл
		ЗаказПостащику = Документы.ЗаказПоставщику.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ЗаказПостащику, СтруктураНовогоДокумента);
		ЗаказПостащику.Дата = ТекущаяДата();
		ЗаказПостащику.Контрагент = СтрокаПоставщика.Поставщик;
		ЗаказПостащику.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(СтрокаПоставщика.Поставщик);
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Поставщик", СтрокаПоставщика.Поставщик);
		
		СтрокиТоваров = ЗаказныеПозиции.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого СтрокаТовара Из СтрокиТоваров Цикл
			СтрокаТабличнойЧасти = ЗаказПостащику.Запасы.Добавить();
			СтрокаТабличнойЧасти.Номенклатура = СтрокаТовара.Номенклатура;
			СтрокаТабличнойЧасти.Количество = СтрокаТовара.КЗаказу;
			СтрокаТабличнойЧасти.Цена = СтрокаТовара.Цена;
			СтрокаТабличнойЧасти.Сумма = СтрокаТовара.КЗаказу * СтрокаТовара.Цена;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТовара.Номенклатура.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.СтавкаНДС = СтруктураНовогоДокумента.СтавкаНДСПоУмолчанию;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			СтрокаТабличнойЧасти.СуммаНДС = ?(ЗаказПостащику.СуммаВключаетНДС, 
											  СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
											  СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ЗаказПостащику.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		КонецЦикла;	
		ЗаказПостащику.СуммаДокумента = ЗаказПостащику.Запасы.Итог("Всего");
		ЗаказПостащику.Записать(РежимЗаписиДокумента.Запись);
		СтрокаЗаказа = Объект.СписокЗаказов.Добавить();
		СтрокаЗаказа.ЗаказПоставщикуСсылка = ЗаказПостащику.Ссылка;
		СтрокаЗаказа.СуммаДокумента = ЗаказПостащику.СуммаДокумента;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗаказовКакСтроку()
	Возврат ЗначениеВСтрокуВнутр(Объект.СписокЗаказов.Выгрузить());
КонецФункции

&НаКлиенте
Процедура СформироватьЗаказыПоставщикам(Команда)
	
	ЕстьОшибки = Ложь;
	Для Каждого СтрокаТовара Из Объект.НоменклатураКЗаказу Цикл
		Если СтрокаТовара.Выбор Тогда
			Если СтрокаТовара.КЗаказу = 0 Тогда
				Сообщить("В строке №" + Формат(СтрокаТовара.НомерСтроки, "ЧН=; ЧГ=") + " не указано количество К заказу!");
				ЕстьОшибки = Истина;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.Поставщик) Тогда
				Сообщить("В строке №" + Формат(СтрокаТовара.НомерСтроки, "ЧН=; ЧГ=") + " не указан Поставщик!");
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	СформироватьЗаказыПоставщикамНаСервере();
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокЗаказовСтрока", ПолучитьСписокЗаказовКакСтроку());
	ОткрытьФорму("Обработка.am_ПомощникМенеджераЗакупок.Форма.ФормаЗаказов",ПараметрыОткрытия,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСформированныхЗаказов(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокЗаказовСтрока", ПолучитьСписокЗаказовКакСтроку());
	ОткрытьФорму("Обработка.am_ПомощникМенеджераЗакупок.Форма.ФормаЗаказов",ПараметрыОткрытия,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
